gosticks/RIOT/drivers/cc3200/include/cc3200_protocol.h

#ifndef CC3200_WIFI_PROTO
#define CC3200_WIFI_PROTO

// #include "protocol.h"
#include "vendor/hw_common_reg.h"
#include "vendor/hw_memmap.h"

#include <stdint.h>

#define H2N_DUMMY_PATTERN (uint32_t)0xFFFFFFFF
#define N2H_SYNC_PATTERN (uint32_t)0xABCDDCBA
#define SYNC_PATTERN_LEN (uint32_t)sizeof(uint32_t)
#define UART_SET_MODE_MAGIC_CODE (uint32_t)0xAA55AA55
#define SPI_16BITS_BUG(pattern) \
    (uint32_t)((uint32_t)pattern & (uint32_t)0xFFFF7FFF)
#define SPI_8BITS_BUG(pattern) \
    (uint32_t)((uint32_t)pattern & (uint32_t)0xFFFFFF7F)

/**
 * @brief SYNC and CNYS patterns used to establish communication with NWP
 * @{
 */
#define N2H_SYNC_PATTERN_SEQ_NUM_BITS \
    0x00000003 /**< 0-2 least significant bits used for seq num over SPI */
#define NWP_SYNC_PATTERN_SEQ_NUM_SET                                    \
    ((uint32_t)0x00000004) /* Flag that sequence number present in sync \
                              pattern */
#define N2H_SYNC_PATTERN_MASK \
    ((uint32_t)0xFFFFFFF8) /* Bits 3 to 31 - constant SYNC PATTERN */
#define N2H_SYNC_SPI_BUGS_MASK                                             \
    ((uint32_t)0x7FFF7F7F) /* Bits 7,15,31 - ignore the SPI (8,16,32 bites \
                              bus) error bits  */
#define BUF_SYNC_SPIM(pBuf) ((*(uint32_t *)(pBuf)) & N2H_SYNC_SPI_BUGS_MASK)
#define N2H_SYNC_SPIM (N2H_SYNC_PATTERN & N2H_SYNC_SPI_BUGS_MASK)

#define N2H_SYNC_SPIM_WITH_SEQ(TxSeqNum)                                      \
    ((N2H_SYNC_SPIM & N2H_SYNC_PATTERN_MASK) | NWP_SYNC_PATTERN_SEQ_NUM_SET | \
     ((TxSeqNum) & (N2H_SYNC_PATTERN_SEQ_NUM_BITS)))

/**
 * @brief Match sync frame with sequence number
 *
 */
#define MATCH_WITH_SEQ_NUM(pBuf, TxSeqNum) \
    (BUF_SYNC_SPIM(pBuf) == (N2H_SYNC_SPIM_WITH_SEQ(TxSeqNum)))
/**
 * @brief Match sync frame without sequence number
 *
 */
#define MATCH_WOUT_SEQ_NUM(pBuf) (BUF_SYNC_SPIM(pBuf) == N2H_SYNC_SPIM)

/* Sync pattern between CPU and NWP */
#define CPU_TO_NET_CHIP_SYNC_PATTERN   \
    {                                  \
        0xBBDDEEFF, 0x4321, 0x34, 0x12 \
    }

/* CNYS Pattern */
#define CPU_TO_NET_CHIP_CNYS_PATTERN   \
    {                                  \
        0xBBDDEEFF, 0x8765, 0x78, 0x56 \
    }

/* N2A_INT_MASK_SET -                   (COMMON_REG_BASE +
 * COMMON_REG_O_NW_INT_MASK_SET)  */
#define N2A_INT_MASK_SET (COMMON_REG_BASE + COMMON_REG_O_NW_INT_MASK_SET)

/* N2A_INT_MASK_CLR -                   (COMMON_REG_BASE +
 * COMMON_REG_O_NW_INT_MASK_CLR)  */
#define N2A_INT_MASK_CLR (COMMON_REG_BASE + COMMON_REG_O_NW_INT_MASK_CLR)

// base address of the wifi spi peripherials
#define WIFI_SPI_BASE 0x44022000
#define WIFI_REG (cc3200_spi_t *)WIFI_SPI_BASE

#define SL_MAC_ADDRESS_GET 2

// ROM VERSIONS
#define ROM_VER_PG1_21 1
#define ROM_VER_PG1_32 2
#define ROM_VER_PG1_33 3

#define REG_INT_MASK_SET 0x400F7088
#define REG_INT_MASK_CLR 0x400F708C
#define APPS_SOFT_RESET_REG 0x4402D000
#define OCP_SHARED_MAC_RESET_REG 0x4402E168
#define ROM_VERSION_ADDR 0x00000400

// SPI SPEEDS
#define SPI_RATE_13M 13000000
#define SPI_RATE_20M 20000000
#define SPI_RATE_30M 30000000

#define mscpi_reg uint32_t
#define wifi_opcode uint16_t

#define SL_RAW_RF_TX_PARAMS_CHANNEL_SHIFT (0)
#define SL_RAW_RF_TX_PARAMS_RATE_SHIFT (6)
#define SL_RAW_RF_TX_PARAMS_POWER_SHIFT (11)
#define SL_RAW_RF_TX_PARAMS_PREAMBLE_SHIFT (15)

#define SL_RAW_RF_TX_PARAMS(chan, rate, power, preamble) \
    ((chan << SL_RAW_RF_TX_PARAMS_CHANNEL_SHIFT) |       \
     (rate << SL_RAW_RF_TX_PARAMS_RATE_SHIFT) |          \
     (power << SL_RAW_RF_TX_PARAMS_POWER_SHIFT) |        \
     (preamble << SL_RAW_RF_TX_PARAMS_PREAMBLE_SHIFT))

#define SL_POLICY_CONNECTION (0x10)
#define SL_POLICY_SCAN (0x20)
#define SL_POLICY_PM (0x30)
#define SL_POLICY_P2P (0x40)

#define VAL_2_MASK(position, value) ((1 & (value)) << (position))
#define MASK_2_VAL(position, mask) (((1 << position) & (mask)) >> (position))

#define SL_CONNECTION_POLICY(Auto, Fast, Open, anyP2P, autoSmartConfig) \
    (VAL_2_MASK(0, Auto) | VAL_2_MASK(1, Fast) | VAL_2_MASK(2, Open) |  \
     VAL_2_MASK(3, anyP2P) | VAL_2_MASK(4, autoSmartConfig))
#define SL_SCAN_POLICY_EN(policy) (MASK_2_VAL(0, policy))
#define SL_SCAN_POLICY(Enable) (VAL_2_MASK(0, Enable))

#define SL_NORMAL_POLICY (0)
#define SL_LOW_LATENCY_POLICY (1)
#define SL_LOW_POWER_POLICY (2)
#define SL_ALWAYS_ON_POLICY (3)
#define SL_LONG_SLEEP_INTERVAL_POLICY (4)

#define SimpleLinkEventHandler SimpleLinkEventHandler

typedef void (*SimpleLinkEventHandler)(void);

typedef struct {
    uint32_t Long;
    uint16_t Short;
    uint8_t Byte1;
    uint8_t Byte2;
} cc3200_nwp_sync_pattern_t;

typedef struct CC3200_RomInfo {
    uint16_t majorVer;
    uint16_t minorVer;
    uint16_t ucSubMinorVerNum;
    uint16_t ucDay;
    uint16_t ucMonth;
    uint16_t ucYear;
} CC3200_RomInfo;

typedef enum wlan_security_t {
    SEC_TYPE_OPEN = 0,
    SEC_TYPE_WEP,
    SEC_TYPE_WPA_WPA2,
} wlan_security_t;

typedef struct {
    int8_t SecType;
    uint8_t SsidLen;
    uint8_t Priority;
    uint8_t Bssid[6];
    uint8_t PasswordLen;
    uint8_t WepKeyId;
} cc3200_nwp_80211_profile_t;

typedef struct cc3200_nwp_80211_profile_config_t {
    cc3200_nwp_80211_profile_t common;
    // base station name
    char *ssid;
    char *key;
    // enterprise config
    // char user[MAX_USER_LEN];
} cc3200_nwp_80211_profile_config_t;

/* IpV4 socket address */
typedef struct SlSockAddr_t {
    uint16_t sa_family;  /* Address family (e.g. , AF_INET)     */
    uint8_t sa_data[14]; /* Protocol- specific address information*/
} SlSockAddr_t;

typedef struct {
    uint16_t opcode;
    uint16_t len;
} cc3200_nwp_header_t;

typedef struct cc3200_nwp_resp_header_t {
    cc3200_nwp_header_t GenHeader;
    uint8_t TxPoolCnt;
    uint8_t DevStatus;
    uint8_t SocketTXFailure;
    uint8_t SocketNonBlocking;
} cc3200_nwp_resp_header_t;

typedef struct {
    wifi_opcode Opcode;
    uint8_t TxDescLen;
    uint8_t RxDescLen;
} WifiCtrlCmd;

typedef struct WifiModule {
    int fd;
} WifiModule;

typedef struct cc3200_SpiStatusReg {
    uint8_t unknown;
    uint8_t rxs;
    uint8_t txs;
} cc3200_SpiStatusReg;

typedef struct {
    uint32_t ChipId;
    uint8_t FwVersion[4];
    uint8_t PhyVersion[4];
    uint8_t NwpVersion[4];
    uint16_t RomVersion;
    uint16_t Padding;
} SlVersionFull;

typedef struct {
    wifi_opcode Opcode;
    uint8_t TxDescLen;
    uint8_t RxDescLen;
} _SlCmdCtrl_t;

typedef struct {
    uint16_t TxPayloadLen;
    uint16_t RxPayloadLen;
    uint16_t ActualRxPayloadLen;
    uint8_t *pTxPayload;
    uint8_t *pRxPayload;
} _SlCmdExt_t;

typedef struct _SlArgsData_t {
    uint8_t *pArgs;
    uint8_t *pData;
} _SlArgsData_t;

// typedef struct _SlPoolObj_t {
//   _SlSyncObj_t SyncObj;
//   uint8_t *pRespArgs;
//   uint8_t ActionID;
//   uint8_t AdditionalData; /* use for socketID and one bit which indicate
//   supprt IPV6
//                          or not (1=support, 0 otherwise) */
//   uint8_t NextIndex;

// } _SlPoolObj_t;

typedef enum {
    SOCKET_0,
    SOCKET_1,
    SOCKET_2,
    SOCKET_3,
    SOCKET_4,
    SOCKET_5,
    SOCKET_6,
    SOCKET_7,
    MAX_SOCKET_ENUM_IDX,
    ACCEPT_ID = MAX_SOCKET_ENUM_IDX,
    CONNECT_ID,
    SELECT_ID,
    GETHOSYBYNAME_ID,
    GETHOSYBYSERVICE_ID,
    PING_ID,
    START_STOP_ID,
    RECV_ID
} _SlActionID_e;

// typedef struct _SlActionLookup_t {
//   uint8_t ActionID;
//   uint16_t ActionAsyncOpcode;
//   _SlSpawnEntryFunc_t AsyncEventHandler;

// } _SlActionLookup_t;

// typedef struct {
//   uint8_t TxPoolCnt;
//   _SlLockObj_t TxLockObj;
//   _SlSyncObj_t TxSyncObj;
// } _SlFlowContCB_t;

typedef enum {
    RECV_RESP_CLASS,
    CMD_RESP_CLASS,
    ASYNC_EVT_CLASS,
    DUMMY_MSG_CLASS
} _SlRxMsgClass_e;

// typedef struct {
//   uint8_t *pAsyncBuf; /* place to write pointer to buffer with CmdResp's
//   Header +
//                      Arguments */
//   uint8_t ActionIndex;
//   _SlSpawnEntryFunc_t AsyncEvtHandler; /* place to write pointer to
//   AsyncEvent
//                                           handler (calc-ed by Opcode)   */
//   _SlRxMsgClass_e RxMsgClass;          /* type of Rx message          */
// } AsyncExt_t;

typedef uint8_t _SlSd_t;

// typedef struct {
//   _SlCmdCtrl_t *pCmdCtrl;
//   uint8_t *pTxRxDescBuff;
//   _SlCmdExt_t *pCmdExt;
//   AsyncExt_t AsyncExt;
// } _SlFunctionParams_t;

#endif
